{"meta":{"title":"light的赛博小窝","subtitle":"哲学、科研、娱乐垃圾场","description":"A cyber wasteland where you can find treasure.","author":"light5QAQ","url":"https://light5QAQ.github.io","root":"/"},"pages":[{"title":"文章归档","date":"2025-09-13T11:48:20.309Z","updated":"2025-09-13T11:48:20.309Z","comments":true,"path":"archive.html","permalink":"https://light5qaq.github.io/archive.html","excerpt":"","text":""}],"posts":[{"title":"悼自动铅","slug":"悼自动铅","date":"2025-09-13T13:03:09.000Z","updated":"2025-09-13T13:41:02.344Z","comments":true,"path":"2025/09/13/悼自动铅/","permalink":"https://light5qaq.github.io/2025/09/13/%E6%82%BC%E8%87%AA%E5%8A%A8%E9%93%85/","excerpt":"“死并非生的对立面，而作为生的一部分永存。” —— 村上春树","text":"“死并非生的对立面，而作为生的一部分永存。” —— 村上春树 于拉尼亚凯亚超星系团-室女座星系团-本星系群-银河系-户臂-古尔德带-本地泡-本星际云-奥尔特云-太阳系的第三行星主要及科技水平最高之生命体通常使用的立法在三维相对时间轴与通常被称为北京时间的时间基准下————————","categories":[{"name":"Chat","slug":"Chat","permalink":"https://light5qaq.github.io/categories/Chat/"}],"tags":[{"name":"Other","slug":"Other","permalink":"https://light5qaq.github.io/tags/Other/"},{"name":"Literature","slug":"Literature","permalink":"https://light5qaq.github.io/tags/Literature/"}]},{"title":"世上最美的解谜者","slug":"世上最美的解谜者","date":"2025-09-06T01:00:52.000Z","updated":"2025-09-06T14:44:48.844Z","comments":true,"path":"2025/09/06/世上最美的解谜者/","permalink":"https://light5qaq.github.io/2025/09/06/%E4%B8%96%E4%B8%8A%E6%9C%80%E7%BE%8E%E7%9A%84%E8%A7%A3%E8%B0%9C%E8%80%85/","excerpt":"关于马尔克斯和PH的拙劣却精美的改编","text":"关于马尔克斯和PH的拙劣却精美的改编 本文最早书于七月二十九日之Q群，今转于此改编自加西亚·马尔克斯《世上最美的溺水者》 最初，几个群友看见群文件里出现那个未命名的零下载的已退群的人上传的压缩包时，曾幻想那是一个优质本子。接着，他们看到那大小不是GB也不到500MB，又想会不会是一个资源整合。直到那东西成功被下载，他们打开压缩包，拨开没有意义的 txt，又点开无数的文件夹，才发现原来是一套题组。整个下午，新人们都在拿这套题组寻开心，一会儿把它做成meme，一会儿又把它改编成俳句，直到有人碰巧看见了，才把消息传进大群里。几个高手把题组转发到到最近的解谜群里，他们发现这题量比他们以前见过的所有题组都要大，跟puzzle boat差不多，于是议论说，兴许这出题者被群里的水灌得太久了，水进到脑袋里了。他们把它放在桌面上，这才看出来，它比其他所有题也要大许多，C盘里几乎放不下它，他们想，也许有些人退群之后还会继续编辑群文件吧。它身上有一股野题的味道，唯有它的内容会使人联想到这是题，因为它浑身上下裹满了乱码和锟斤拷烫烫烫。不需要把它的文本理清楚就可以肯定出题者不是群中常驻人口。这个群总共只有两百来人，在一个时间的尽头随意发言，一个个默认文本框里一道题都见不到。出题者少得可怜，旧人们整日担心新人会被嫌无聊退群，历年来退圈的几个人都被踢出了群聊。但这个群是温和而慷慨的，一个表格就可以装下这里所有人。所以，找到那套题的时候，他们只须看看彼此，就可以确定自己人一个都没少。那天晚上，大家都没有做题。善谈者出去打听附近的群里是否少了人，内向者则忙着查看那个压缩包。他们把它解压，删掉无用的文件夹，把那些UTF错误改正，又修改文本的格式。做着这些事，他们注意到题干的那些引用都来自冷门的圈子和古籍深处，它的修改痕迹无处不在，像是曾在批评家的书房中横穿。他们还注意到，它以一种骄傲的姿态忍受着修改，ft没有别的经受批判的人的那种孤独，也不像心灰意冷退群的人那样容色灰败，可怜巴巴。但直到为这题梳理完毕，他们才意识到它绝妙无比，一时间大家都屏住了呼吸，这题不但最大最标准，思路够清晰，难度梯度是他们见过的最完美的，而且，他们越看越觉得自己的想象力不够用。群里找不到一个足够合适的文件夹停放这个压缩包，也找不到一个足够勇敢的人刨析这套题。最好的nutri使用者无法爆破它的题，最强的瞪眼大神也瞪不出它的题，而这些题的解法似乎又那么简洁，那么美好，pher们被它异乎寻常的题干和精细的美工迷住了，一致决定从灰机wiki上开辟一个页面来记录它，再用所有群内文豪的笔力写一篇文章，好让出题者退群后继续保持体面。他们围坐成一圈做文笔工作，不时朝那套题瞟上一眼，都觉得风从未像那天夜里那样顽强过，大群也从来没有那样焦躁不安过，他们猜测，这些变化一定和这个压缩包有点儿关系。他们想，要是这个了不起的出题者曾住在他们市，他家的房门应该会最宽，房顶会最高，地板会最结实，床架会用船的主肋做成，再用铁螺栓上紧，他的女人会是最幸福的女人。他们想，这个人一定很有威望，他只须喊一喊各种密码的名字，密码们便会自动解码。他做起ph来一定十分卖力，能从最普通的文本中看出一道题，能在纯苦力题上找出简便解法。他们暗暗把他和自己的群友比较了一番，心想，群友一辈子能干的事儿恐怕都抵不上这人一夜干的事儿，最后，他们从心底里觉得这人是世上最强大的pher。正当他们这样想入非非的时候，他们中间最老的那个pher——因为最老，他看那个溺水者的时候，目光里少了些敬佩，多了些怜悯——叹了口气说：“看脸的话，他应该叫你。”没错。对大多数人来说，只须再想一下就会明白，这人不可能有别的名字。最年轻的几个pher更顽固些，他们还在幻想，如果让他参加MITMH，让他做那些有名的洋hunt，再和群友聊聊百合，也可以叫他您。他们的这种幻想终归是徒劳的，他的账号已经注销，不留一点痕迹，更糟糕的是他们写的wiki页面也很烂，因为他们根本不了解他，而且他题中隐藏着的力量让一切文字显得那么浅薄。后半夜，风声小了许多，星期三的钢筋森林显出一副昏昏沉沉的模样。一片寂静之中，pher们最后的疑问也消除了：这人就是你。最后不得不把页面删除的时候，那些给他绘图、作传、推测、描写的人们都不由自主地心生怜悯。直到此时他们才明白，拖着这副庞大的思想，他连退群了都这么伟大，在群里的时候该有多么智慧。他们知道他聊天要小心翼翼，经常会让别人听不懂。出门做客只能站着，一双海狮般粉嫩的手不知往哪儿放才好。女主人还得找出家里最聪明的人，胆战心惊地对他说，你，劳驾和他聊天吧。而他呢，靠在墙角微笑着，您别麻烦了，太太，我这样就挺好。因为每次出门做客都碰到这样的事，他的思想更加深邃，说话更加小心翼翼。您别麻烦了，太太，我这样就挺好，他这样说只是因为不想让其他人疑惑而丢脸。他也许从不知道，那些对他说，别走，你，至少等到咖啡煮好的人，会在他身后叽叽咕咕，那个谜语人走了，谢天谢地，那个长了副漂亮脸蛋的谜语人总算走了。天亮以前，那群解谜人面对着题组，脑子里转的尽是这些事。后来，他们给他发了个公告，免得有人不知道他，这时他们看见他是真的退群了，他们一脸无助，他们心里柔弱的那一面被打开了，第一个开始抽泣的是某个最年轻的解谜者。其他人你影响我我影响你，开始是叹息，后来便哭出声来，越抽泣就越想哭，因为那出题的人在他们眼里越看越像你，最后，在他们的哭泣声中，可怜的你成了地球上最智慧而又孤独的人，但脾气最好且最乐于助人。最后，打听消息的人们回来了，带来消息说附近几个群里都没有这个人，他们泪眼婆娑之余都感到莫名的喜悦。“赞美西西比西皮凯由！”他们叹息道，“是咱们的人！”其他人把他们这种大惊小怪的反应视为文豪的伤感，他们打听了一夜，现在想的唯一一件事就是，在这个干旱无风的日子里，趁阳光还没有变得炽热，彻底摆脱这个沉默的家伙带来的麻烦。他们用几个废旧的网站做了一个纪念碑，又把它放在没人会看到的地方，好将那个人放在记忆的另一头。他们还打算给那家伙的脚踝上用铁链拴个铁锚，好让他顺顺当当地沉到大数据之海最深处，在那里，鱼都是瞎子，潜水的人死于乡愁，这样，他就不会像别的东西，被可恶的潮水突然推流。可是，他们越是着急，文豪们就越是想出更多花样来拖延时间。他们活像一群浴盆里的阿基米德，在D盘里翻寻之前出的题，这边刚有几位发出之前写的write-up，那边又有几位发送高难度日谜。快让开，群友，找个不碍事的地方待着去，瞧瞧你差点儿把群整成99+，说了许多遍这样的话之后，他们们终于起了疑心，开始骂骂咧咧，为什么把这么多时间放在这么一个没发过言的人身上，你就是给他买个服务器，最后还不是让人忘掉，可群友们还是坚持，不是掉眼泪，就是唉声叹气，最后他们们开始爆粗口，不就是一个账号已注销，一个谁也不认识的破解谜的，一堆蛋白质吗，这儿什么时候为这种人闹过这么大动静。有个群友被这些全无心肝的话惹恼了，发送了经过整理的题组，他们的呼吸一下子停止了。那是你。无须再看第二眼，谁都能认出那就是他。要是有人告诉他们这人是light5QAQ，他们大概认不出来，但在这世上，你只有一个，此刻他像个魔术师一样化身成了账号已注销，不留任何痕迹。题组一发出来，大家全都看出来了，这人思想过于深刻：这么复杂，这么深邃，还这么谦虚：这不是我的功劳，早知如此，我会把题组扔掉回收站里，我是认真的，就像那些不想出名的人一样，免得如今被说成是一堆蛋白质，到处碍事，用这堆跟我已经毫无关系的躯壳招人烦。你的ft是那么真诚，就连那些最爱疑神疑鬼的群友，他们在床上整夜睡不着觉，担心自己有一天梦见的不再是自己而是那些苦力题，就连他们，还有那些更加铁石心肠的群友，都被你的真诚深深打动了。就这样，人们给一个弃婴似的退群者举办了一场他们所能想象的最华美的纪念。有几个群友到附近的群和外网的论坛里寻找用以纪念的题，回来的时候身后跟着一些半信半疑的人，看到这个题组之后，这些人也去寻找，招来更多人和更多题，最后，题挨着题，人挨着人，卡得消息都发不出去。到了最后一刻，人们又觉得让他以账号已注销的身份重新被丢进01沙漠里太让人心疼了，于是又从最好的账号中间给他挑选了替身，这个人自愿捐赠账号以永远纪念他，其他人则愿意发送动态、改变名字、建立群聊，到最后，全群人都因为他互相增进了关系。有一些远远听说了这里的事情的网友迷失了互联网定位，据说其中一位网友想起了古老的希伯索斯传说，让人把自己投进了大数据之口，自称愿意为此殉道。就在人们为着谁有资格建立他的纪念网站争执不下时，男人和女人们第一次感觉到，在这个华贵美丽的解谜者面前，他们的加密是多么荒凉，搜索是多么乏味，排序又是多么苍白。他们在互联网建立纪念锚点的时候没有让它随意漂浮，好让他想回来的时候就可以回来。那个账号好像过了好几个赛博世纪才消失殆尽，在这个过程中，人人都屏着呼吸。他们无须看向彼此就已明白，他们已经不再完整，而且再也不会完整了。人人都明白，从此刻起，一切都将变得不一样，他们的思路将变得更好，出题水平将变得更高，思想将变得更充实，以便在大家的记忆中你可以通行无阻，不会再感到不自在，今后谁也不敢再嚼舌头，用他做meme之类的，因为他们会把群里的氛围变得更美好，好永远记着你，他们还要弯下腰去，在群友间挖出天才，在死胡同上开出新路，为的是在将来的某个清晨，那些新进群的解谜者在询问原因时，群主会穿着礼服，带着他的解谜者勋章和密码机器，胸前挂着一排在网上搜集来的珍稀资料，从二群走来，指着那充满故事的群聊和互联网上那永远虚幻又永远存在的锚点，用十四种语言说，请往那里看，那里如今风声温柔，微风在人们床下驻足，就在那边，在那阳光炽烈、向日葵不知道该往哪边转的地方，是的，就在那里，那是你曾经呆过的群。","categories":[{"name":"Artwork","slug":"Artwork","permalink":"https://light5qaq.github.io/categories/Artwork/"}],"tags":[{"name":"PH","slug":"PH","permalink":"https://light5qaq.github.io/tags/PH/"},{"name":"Philosophy","slug":"Philosophy","permalink":"https://light5qaq.github.io/tags/Philosophy/"},{"name":"Literature","slug":"Literature","permalink":"https://light5qaq.github.io/tags/Literature/"}]},{"title":"Golden PH write-up","slug":"Golden-PH-write-up","date":"2025-08-30T07:19:59.000Z","updated":"2025-09-06T14:40:00.223Z","comments":true,"path":"2025/08/30/Golden-PH-write-up/","permalink":"https://light5qaq.github.io/2025/08/30/Golden-PH-write-up/","excerpt":"金牌线团队举办的Golden Puzzle Hunt的总结","text":"金牌线团队举办的Golden Puzzle Hunt的总结 hi guys这是一篇关于一个很久之前的hunt的write-up因为某些原因未能完赛本文仅限我做过的部分(其实也差不多) 序章看都不看 新手教程新手教程我：？ 我毫无头绪小学数学练习题题号后就是数字，太明显了秒了 小学数学练习题有意思，有点语言学的感觉了最后那个“答案是冒号(保持)”也是函数有点惊喜秒了 剪切线ft何意味？大盘太难了，愿马上相逢无纸笔，提示x1学会了白色数字可以在surface mode涂色后看到奇怪的penpa+知识get！fez不难想(英语单表1&#x2F;1000) 纸不笔谜题带到学校做的秒了 水果拼盘不会做mangled connectionsskip 这题太色了做出公司、赛事、物理量之后爆破的，题干都没看懂秒了 〇〇，启动！痛苦一眼MC题，填词部分秒了，版本部分被困在羊毛一整天，不断fallen niles 金牌得主不会做crypticskip 神秘等式一眼钟表，中文有点意思秒了 META:我毫无头绪最痛苦的一道题一眼APG+cw，但是国内没有查询网站，重金买人工提示也没给有用的网站，人工提示+1谁能想到是LCA啊填了几个确定的然后爆破了 该如何提取首先你来到秋叶原一眼BanG Dreams+地铁题(月球有点意思)skip 谜途指北找到上下左右键之后没想到看数量并象形，提示+1，还是功力不够 历史的进程简单历史推断题，好玩秒了 小游戏5位二进制看出来了，but是否有解谁能想到啊，提示+1 填字游戏一眼cw(后来发现还有纸笔)skip 断章实在想不到，提示+3到注音那一步死活不提交里程碑，不知道怎么想的当然还是有点惭愧，常年做丁香谜、翻字典也没想到 亚特兰蒂斯的秘密一眼单表，时间不够买的提示，提示+1(事实上因为有重复字所以quipquip也不行，幸运)(事实上可以直接搜索亚特兰蒂斯+语言搜到，还是意识不足(英语单表2&#x2F;1000))破译其实也很费时，也在提取部分卡了很久 弱纸吧对着t1往noq里输了很久后来发现无固定解往下面一翻发现无数字数独捧腹大笑我是弱纸，好玩秒了 飞行棋一眼机场代码，字母在骰子角上没想到 提示+1 META:该如何提取赛后5min解决了，不难 该如何排序印表机的恶作剧我不是很會說臺灣話啦，填字部分也不太會填啊，所以呢skip啦 空白小抄有意思，不难，？&#x3D;问有创意skip 古诗窃贼最好玩的一道，古诗谐音输入法和语音转文字立大功秒了 赛博艺术一眼世末歌者系列没看懂题，提示+2没看懂提示，人工提示+1中v人的脸丢光了无语了 新加坡之旅一眼歧义词二进制秒了 公式化海龟汤5位二进制出nutrimatic一眼做公式(说实话此题大大提升我的nutri水平)没想到解方程，提示+1 金牌谜题赏看到是杂题直接skip赛后发现好像错过了一道很好的题和一道很好爆破的题 Word☆Play一眼少女☆歌剧Revue Starlight苦力题秒了 表意文字象形之集大成作(？着实想了一会 META:该如何排序没做，难度好像不大 此后的题都没做，但是都不太好(感谢此次比赛感谢我自己 PS我写此文章初稿时写了1个小时但电脑没电了，没保存","categories":[{"name":"Entertainment","slug":"Entertainment","permalink":"https://light5qaq.github.io/categories/Entertainment/"}],"tags":[{"name":"PH","slug":"PH","permalink":"https://light5qaq.github.io/tags/PH/"},{"name":"Write-up","slug":"Write-up","permalink":"https://light5qaq.github.io/tags/Write-up/"}]},{"title":"light如是说——AKA《Hello World》详解","slug":"light如是说——AKA《Hello World》详解","date":"2025-08-24T13:47:07.000Z","updated":"2025-09-06T14:42:59.768Z","comments":true,"path":"2025/08/24/light如是说——AKA《Hello World》详解/","permalink":"https://light5qaq.github.io/2025/08/24/light%E5%A6%82%E6%98%AF%E8%AF%B4%E2%80%94%E2%80%94AKA%E3%80%8AHello%20World%E3%80%8B%E8%AF%A6%E8%A7%A3/","excerpt":"关于我的文章的断章取义式的，以小见大式的探究","text":"关于我的文章的断章取义式的，以小见大式的探究 light四岁的时候，他离开了他的故乡和故乡之湖，而去住在山上。他在那里保真养晦，毫不厌倦地过了十年。——可是，他的内心到底有了转变。一天早晨，他黎明时起身，而对着太阳说：“啊，你，伟大的星球啊！假若你没有被你照耀的人们，你的幸福何在呢？十年来，你每天向我的山洞走来：假若没有我，和我的鹰与蛇，你会厌倦于你自己的光明和这条旧路罢。但是，每天早晨，我们等候着你，我们取得了你的多余的光明，因此我们祝福你。看啊！我像积蜜太多的蜂儿一样，对于我的智慧已经厌倦了；我需要伸出来领受这智慧的手。愿意赠送与布散我的智慧，直到聪明的人们会再因为自己的疯狂而喜欢，穷困的人们会再因为自己的财富而欢喜。因此，我应当降到最深处去：好像夜间你走到海后边，把光明送到下面的世界去一样。啊，恩惠无边的星球啊！我要像你一样地’下山’去，我将要去的人间是这样称呼这件事的。祝福我罢，你这平静的眼睛能够不妒忌一个无量的幸福！祝福这将溢的杯儿罢！使这水呈金色流泛出来，把你的祝福的回光送到任何地方去罢！看呵，这杯儿又会变成空的，light又会再做人了。”——light之下山如是开始。 后面的内容自然不用说，light遇到了隐士，进入了城市，开始讲道，然而和查拉图斯特拉不同，他并未讲述超人与猿猴，而是掏出了一片破帛，上写两行大字： ###Hello World欢迎来到我的博客，今天是博客建站的第一天，以后也请多多指教。 诸位作为上层叙事对于此话自然不陌生，这正是light5QAQ的第一篇文章：然而文中的light和路人自然不会知道这是什么，正当路人们为之疑惑时，light露出释经家和传教士一般的笑容，即使他从未见过。 他讲起了故事：Hello world本身是一个用于测试程序的常见短语，也是计算机入门的常用短语。在这里，这个短语被用来当作第一篇博客的标题可是再合适不过。我秉持着梭罗的想法：与拥有一个健全的良心相比，一般人更在乎衣着。因此标题必然拥有某些特殊含义。据传在宇宙大爆炸中熵增的滚滚车轮，亚当夏娃咬下罪恶之果却成就人类的辉煌与更多罪恶，盘古从虚空中拿出那本不存在却又永远存在的大斧，混沌的卡俄斯却孕育出规律，金恩加格之鸿沟的劈开分割了世界与生命，梵天从金蛋中破壳用自己的侧面营造了神话宇宙等等更之前，有一块石头，无论这块石头为何出现，它都是起始的象征。它见证了世界的诞生“H”，生命的出现“e”（据某哲学家&#x2F;语义学家所说：元音是生命的象征），物理意义上的生物灭绝和精神意义上的黑暗时代“ll”，生物体的开悟“o”。巨石&#x2F;花岗岩&#x2F;高山&#x2F;地基陷入沉思，阻碍并非毫无征兆，字母e中的开口和内部的横线象征生物体的混乱、争端；在黑暗时代过去之后的字母o，象征生物在经历挫折后达到一种超然的状态，是一种理想世界，正如尼采，他最爱人类的不思进取、懒惰、愚蠢等诸多品质，正是这些品质带领人类不断下滑，猿猴不如却又能够最终开悟。亦是说：他越是要到高处、光明处，他的根就越是猛烈地伸向大地中，越是向下，越是进入到黑暗中、进入到深处，——进入恶的里面。e便是本我，只知享乐；ll便是自我，最为现实，在本我和超我间调整；o就是超我，最为理想。 TBC……","categories":[{"name":"Artwork","slug":"Artwork","permalink":"https://light5qaq.github.io/categories/Artwork/"}],"tags":[{"name":"Philosophy","slug":"Philosophy","permalink":"https://light5qaq.github.io/tags/Philosophy/"},{"name":"Literature","slug":"Literature","permalink":"https://light5qaq.github.io/tags/Literature/"},{"name":"Theory","slug":"Theory","permalink":"https://light5qaq.github.io/tags/Theory/"}]},{"title":"哲学思考","slug":"哲学思考","date":"2025-08-23T01:58:18.000Z","updated":"2025-09-06T14:45:36.346Z","comments":true,"path":"2025/08/23/哲学思考/","permalink":"https://light5qaq.github.io/2025/08/23/%E5%93%B2%E5%AD%A6%E6%80%9D%E8%80%83/","excerpt":"关于哲学的一些极小思考","text":"关于哲学的一些极小思考 1. 语言的漏洞诸位想，解释一个词&#x2F;字需要用其他的词&#x2F;字解释那个用于解释的词&#x2F;字还需要使用新的词&#x2F;字所以如果单单给你一本字典，你就算把字典翻漏了也不能看懂这门语言这时候有人就要问了: 啊light5QAQ 照你这么说我是怎么学会中文的呢事实上因为你并不是直接通过解释学会的，你是通过定义学会的例如你最早学到“太阳”这个词的时候，你实际并不是记住”太阳是一颗黄矮星，是太阳系中心的炽热天体”而是记住天上发光的那个东西叫做太阳所以你通过定义绕过了解释 虽然大多数情况下定义属于一种解释，但是我这里的解释是指通过其他的东西进行指代，反之，定义是直接指代 那么引申下来我又想了，我们只有通过对真实物体的直接定义才能理解一个词反之，我们是否永远无法理解抽象概念呢或者说，我们永远无法准确的描述抽象概念呢？我想举一个简单的例子，假如我眼中的蓝色与你眼中的红色是一样的，但是因为我从小都被教导说太阳的颜色是红色，所以我在日常生活中不会展现和你的任何不同这就是一个无法描述抽象概念的例子当然，想要准确描述也是有方法的，我们需要把抽象概念具象化例如解剖我的眼睛，直接观察视锥细胞。然而在现实中有很多的抽象事物是难以具象化的所以哲学中试图总结出抽象事物的规律是否是合理的呢用不准确的语言想要总结出准确的规律是可能的吗? 2. 忒修斯之船大家可能都知道忒修斯之船，故事是这样的：人们把忒修斯建功立业的那艘船命名为“忒修斯之船”。随着时间的流逝，这艘船的部件逐渐腐朽，人们不断用新部件替换它，最终所有部件都被更换过了。由此产生的问题是，这艘船还是原来那艘忒修斯之船吗？这个问题我曾经想过很久，总是得不到令我满意的答案前一阵看一个视频，视频中提到人的身体也是一艘忒修斯之船，身体中的所有细胞随着时间逐个替换后人也会更迭我由此得到启发当然，更迭一次后的人还是原本的人，因为在逐个更换的过程中身体可以进行同化的过程所谓原来的船不过是记忆中的船，而在替换零件的过程中记忆也会随之改变只要船长还是忒修斯，只要回忆没有忘却即使在磅礴的巨浪中船变成了一堆碎末这艘船依旧是原本的船 UPD:2025-8-26从语义学上看此题无解同一性无统一标准 3. 法律和道德这个理论很简单 就是：道德≤法律＜道德首先法律以最根本的道德为基础 例如不能杀人 不能偷盗等然而道德也不能过高 例如电车难题","categories":[{"name":"Chat","slug":"Chat","permalink":"https://light5qaq.github.io/categories/Chat/"}],"tags":[{"name":"Philosophy","slug":"Philosophy","permalink":"https://light5qaq.github.io/tags/Philosophy/"},{"name":"Theory","slug":"Theory","permalink":"https://light5qaq.github.io/tags/Theory/"}]},{"title":"Dijkstra算法","slug":"Dijkstra算法","date":"2025-08-22T23:40:54.000Z","updated":"2025-09-06T14:41:25.283Z","comments":true,"path":"2025/08/23/Dijkstra算法/","permalink":"https://light5qaq.github.io/2025/08/23/Dijkstra%E7%AE%97%E6%B3%95/","excerpt":"Dijkstra算法的简介和练习","text":"Dijkstra算法的简介和练习 Dijkstra 算法是一种快速，便利地计算非负权图上单源最短路的算法。什么？你问我什么是图？好吧，让我们从头开始。图说白了就是许多连线的点，可以近似为城市和中间的路。图分为有向图和无向图，可以近似为单向路和双向路。权值就是通过这条路所需的代价，是一个数字。而单源最短路就是两个点之间的最短路径。 而Dijkstra 算法的方法就是先将起点与其他点的举例设为inf,与自己的距离设为0. 再把点分为两种,已确定最短路长度的点集S,和未确定最短路长度的点集T. 一开始所有的点都属于T.然后重复这些操作： 从T中,选取一个最短路长度最小的结点，移到S中. 对那些刚刚被加入S集合的结点的所有出边执行松弛操作.直到T为空,算法结束.至于什么是出边,就是可以出去的单行道,什么是松弛,就类似dp,重新计算距离.通常使用朴素做法或优先队列做法. 很简单对吧，那么你可以开始做题了。 P4779 【模板】单源最短路径（标准版）题目描述给定一个n个点,m条有向边的带非负权图,请你计算从s出发,到每个点的距离.数据保证你能从s出发到任意点. 输入格式第一行为三个正整数n,m,s. 第二行起m行,每行三个非负整数u[i],v[i],w[i],表示从 u[i]到v[i]有一条权值为w[i]的有向边. 输出格式输出一行n个空格分隔的非负整数，表示s到每个点的距离。&#96; 既然是模板题，那就直接上模板吧！ 12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152#include&lt;bits/stdc++.h&gt;using namespace std;const int N=1e5+5;const int inf=0x3f3f3f3f;int vis[N]; //int dis[N]; //存储点s与其他点的距离 int n,m,s;struct node&#123; int v,w; bool operator &lt;(const node &amp;x)const&#123; return x.w&lt;w; &#125; //重定向 小于号把priority_queue变成小根堆 &#125;; //存储最短路vector&lt;node&gt; g[N]; //存距离priority_queue&lt;node&gt; q; //优先队列默认大根堆void dij()&#123; dis[s]=0; //自己为0 vis[s]=1; // q.push(node&#123;s,0&#125;); //存入s本身 while(!q.empty())&#123; node t=q.top(); q.pop(); int now=t.v; vis[now]=0; for(int i=0;i&lt;g[now].size();i++)&#123; int v=g[now][i].v; if(dis[v]&gt;dis[now]+g[now][i].w)&#123; dis[v]=dis[now]+g[now][i].w; if(vis[v]==0)&#123; q.push(node&#123;v,dis[v]&#125;); vis[v]=1; &#125; &#125; &#125; &#125;&#125;int main()&#123; cin&gt;&gt;n&gt;&gt;m&gt;&gt;s; for(int i=1;i&lt;=n;i++)&#123; dis[i]=inf; //存为inf &#125; while(m--)&#123; int u,v,w; cin&gt;&gt;u&gt;&gt;v&gt;&gt;w; g[u].push_back(node&#123;v,w&#125;); //存储权值 &#125; dij(); //Dijkstra for(int i=1;i&lt;=n;i++)&#123; cout&lt;&lt;dis[i]&lt;&lt;&quot; &quot;; &#125; return 0;&#125; 你看懂了吗？很好！那么我们再来做一道题练练手！ P1629 邮递员送信题目描述有一个邮递员要送东西,邮局在节点1. 他总共要送n−1样东西,其目的地分别是节点2到节点n. 由于这个城市的交通比较繁忙,因此所有的道路都是单行的,共有m条道路. 这个邮递员每次只能带一样东西,并且运送每件物品过后必须返回邮局. 求送完这n−1样东西并且最终回到邮局最少需要的时间. 输入格式第一行包括两个整数,n和m,表示城市的节点数量和道路数量.第二行到第(m+1)行,每行三个整数,u,v,w,表示从u到v有一条通过时间为w的道路. 输出格式输出仅一行,包含一个整数,为最少需要的时间. 不难发现邮递员每次去要走最短路，回也要走最短路，那么只需要简单的正反跑Dijkstra就好了 12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849#include&lt;bits/stdc++.h&gt;using namespace std;const int N=1e6+5;int n,m,u,v,w;long long ans;struct node&#123; int x; long long dis; node(int X, long long DIS) : x(X),dis(DIS)&#123;&#125; //这是什么意思呢 bool operator &gt;(const node&amp;o) const&#123;return dis&gt;o.dis;&#125;&#125;;int inf=INT_MAX;int ver[N],wei[N],nex[N],head[N],tot; //依次存储v w 下一个点 计数priority_queue&lt;node,vector&lt;node&gt;,greater&lt;node&gt; &gt; q;long long dis[N];void addedge(int u, int v, int w)&#123; //建边 ver[tot]=v,wei[tot]=w,nex[tot]=head[u],head[u]=tot++;&#125;void dij(int s)&#123; for(int i=1;i&lt;=n&lt;&lt;1;++i) dis[i]=inf; dis[s]=0; q.push(node(s,0)); while(!q.empty())&#123; node cur=q.top(); q.pop(); if(dis[cur.x]&lt;cur.dis) continue; for(int i=head[cur.x];~i;i=nex[i])&#123; if(dis[ver[i]]&gt;cur.dis+wei[i]) &#123; dis[ver[i]]=cur.dis+wei[i]; q.push(node(ver[i],dis[ver[i]])); &#125; &#125; &#125;&#125;int main()&#123; memset(head,-1,sizeof(head)); cin&gt;&gt;n&gt;&gt;m; for(int i=1;i&lt;=m+1;i++)&#123; cin&gt;&gt;u&gt;&gt;v&gt;&gt;w; addedge(u,v,w); addedge(v+n,u+n,w); //反向 &#125; dij(1); for(int i=2;i&lt;=n;++i) ans+=dis[i]; dij(1+n); for(int i=2+n;i&lt;=n&lt;&lt;1;++i) ans+=dis[i]; cout&lt;&lt;ans&lt;&lt;endl; return 0;&#125;","categories":[{"name":"Tech","slug":"Tech","permalink":"https://light5qaq.github.io/categories/Tech/"}],"tags":[{"name":"Code","slug":"Code","permalink":"https://light5qaq.github.io/tags/Code/"}]},{"title":"中二病でも恋がしたい中的悲剧色彩与内核解析","slug":"中二病でも恋がしたい中的悲剧色彩与内核解析","date":"2025-08-22T09:31:42.000Z","updated":"2025-09-06T14:46:21.508Z","comments":true,"path":"2025/08/22/中二病でも恋がしたい中的悲剧色彩与内核解析/","permalink":"https://light5qaq.github.io/2025/08/22/%E4%B8%AD%E4%BA%8C%E7%97%85%E3%81%A7%E3%82%82%E6%81%8B%E3%81%8C%E3%81%97%E3%81%9F%E3%81%84%E4%B8%AD%E7%9A%84%E6%82%B2%E5%89%A7%E8%89%B2%E5%BD%A9%E4%B8%8E%E5%86%85%E6%A0%B8%E8%A7%A3%E6%9E%90/","excerpt":"关于动漫，爱情的些许探讨","text":"关于动漫，爱情的些许探讨 本文最早书于八月七日之洛谷，今转于此 zeb与六花 起因 于2025慕名观看此番，然而追完后并未感到甜蜜或快乐，空余惆怅，不知为何，陷入思考，便有此文。 六花转手可爱捏 简介 中二病でも恋がしたい是一部以校园爱情为主题的经典搞笑中二向动漫(下称zeb)，全剧围绕小鸟游六花的中二病发展以及她和富㭴勇太的情感发展展开。我在一定时间的思考与观察后得出结论： 此番的根本感情基调是悲伤的 Part 1——中二之怅 请注意 各个Part之间会有共同点 所以尽量不要跳读作为zeb的卖点，六花等人对中二病的感情变化是该动漫着重描写之处。该变化主要分为两类，一是以小鸟游六花为首的逐渐淡化，二是以丹生谷森夏为首的旧病复发。关于这两种情况哪种属于广义上的最优解应当辨证看待：六花变得更为现实，这在她与勇太的交往中可可以便于更好处理对日常生活的各种问题；而森大人（即丹生谷）变得更为快乐。 可是真的如此吗？我们应当思考。我们应当思考。本作品为什么可以红极一时，除去精良的制作与人物塑造，最重要的一点就是日漫的受众群体大多都曾有过中二的一段日子，包括我。我曾有一把剑，幻想十步杀一人，千里不留行；我曾有一艘船，幻想驶向加勒比海，背对朝阳；我曾有一根法杖，幻想面对强敌，光芒万丈；我也曾有一颗鹅卵石，幻想内藏恶龙的幼崽，未来可以御龙飞翔。然而尽管时间的笔刷将回忆化作沉积岩，我仍然无法摆脱小时候养成的习惯，在无聊时我依然会幻想我自小就在幻想的那个虚拟世界，我也曾试图摆脱，但它却早已经成了我的一部分。正如zeb剧中所说 大家都说「中二病太让人难为情了」 还说「好想把那段记忆删掉 永远也不要想起来」 但是 当初那个古古怪怪的自己 真的会消失吗 那个总是妄想着自己被监视 那个给自已设定了角色 并化身为那个角色的自己…人有时候总会夸夸其谈 梦想着突然发生改变的世界 在脑海中想象着遥远的未来 想象着那不存在的 轰轰烈烈的爱情 那就是 从生至死 在人的内心不断复发 永远无法彻底痊愈的 有些伤感 有些害羞 还有些可爱的 名为「自我意识过剩」的病症 是一种名为「自我」的 谁都无法回避的人生 没错 人啊 一辈子都是中二病 那么推己及人，六花真的可以改变吗？剧中给出的答案是肯定的，勇太认为六花的中二是为了掩盖她丧父的悲伤，但是随着悲伤的消逝中二病就可以结束吗？我觉得这一点的答案不言自明。可是随着年龄的增长和生活的繁忙，中二病将会被迫流失，最初并无明显感觉，而当她意识到的那一瞬间，心中的空虚将足以摧毁这个人。同理森大人之类虽然得到了暂时的快乐，但是最终的结局也是想当然的。 各角色中二病形态 Part 2——爱情之惘 zeb的第二个主题是爱情，虽然zeb以六花和勇太的故事为主线，但是恋爱的故事却分为了数个部分：六花与勇太、七宫与勇太、茴香与一色诚，凸守和丹生谷的百合。以下我将依次讨论。 2.1 六花与勇太 关于他们，我送上祝福，总的来说这是一对完美的couple，无论是兴趣爱好或者是性格都很相似互补(这两个词与数学无关)然而他们间依然矛盾重重，而且，用森大人的话说：发展地像蜗牛一样慢。所以必然的，在剧场版中两者间发生了一次巨大的矛盾，最终以六花醒悟收尾，但是正如拜伦所说：恋爱是艰苦的，不能期待它象美梦一样出来。一次巨大的危机怎能如此轻易的结束呢？ 这次危机的缘由积怨已久，重点主要在于六花在中二病与恋爱间难以抉择，于是独自逃走，最终在七宫的点明下重归于好并最终接吻，可是令我很困惑的是作者并没有赋予该场面以其应有的意义，它的运镜并没有集中而是远景，没有烟花而是飞鸟甚至遮挡了视线，值得注意的是在接吻前勇太强调了爱情的短暂。这一切在我看来都别有深意，结合两人的正常发展速度我得出结论，两人关系产生了不正常的变化，是的，尽管争吵可能促进发展，但是这次争执却触及到了六花心中根本的执念，她不敢抉择，她不能抉择。这次接吻也很特殊，按照剧情中的发展流程，这本应更早发生，然而因为种种原因未能如愿。诸君请想，这正常吗？顺水推舟两厢情愿的事情没有任何的理由拖延啊，实则这是因为他们并没有准备好，没有准备好为了彼此改变，没有准备好放弃之前的生活，没有准备好承担情人的责任，他们没有准备好。而争吵后的接吻我认为这更形似一场古希腊式的献身，一场悲剧的开幕。可是这一切最最最根本的缘由其实一直都在提示我们，guys，请注意标题，这场轰轰烈烈的，记录在所有二刺螈史册和灵魂上的恋爱就是源自中二病而且由中二病推动，尽管中二病使得恋爱的进展十分缓慢，这是踏踏实实的。正如五月七日茴香所说： 六花是被中二病拯救的女孩 是注视着你 憧憬着你的中二病以及坚强信念的女孩 是被你的力量迷倒 并试图模仿你的力量的女孩 所以她选择的是富樫君 非富樫君不可 六花是不应该自我改变试图脱离中二病的，在她改变的过程中她逐渐失去了本心和前进的方向，因为中二病就是她爱上勇太的契机啊！在改变的路途中，两人注定会渐行渐远。 “你要看我的眼睛吗”——两人初识 2.2 七宫与勇太 我愿称七宫与勇太为整部番中最意难平的一对，七宫是勇太的青梅竹马，她可称是勇太中二病的导师和源头，可是七宫将勇太拉入了中二病的领域，勇太却把七宫陷入爱情的泥沼，勇太当时一心中二，并没有察觉到七宫的情绪变化，而最终七宫被迫转学离开了勇太。七宫有言道： “如果…如果那时候” “握住的不是金币而是勇者的手的话” 七宫的中二病是全剧最严重的，她却是最清醒的她清醒地知道中二病对她人生的影响和地位，她曾在勇太和中二病间选择了中二，而5年后她再次和勇太会面时她也未曾后悔。但这并非意味着她已不会心动，在那个所有七宫厨都会铭记一生的雨夜，她为了验证自己能否彻底舍弃勇太，她要求勇太说明六花的优点，此次对话以勇太担心六花没带伞而离开，七宫自认为没有哭出来而成功，却被回来送伞的勇太破防。她是失败的，因为她仍然喜爱勇太；她是成功的，因为她确定了自己仍然喜爱勇太。尽管在接下的剧集中佯装没事，可是作为旁观者，我们能从她的深情中看到淡淡的悲伤。就像是酒中的啤酒花香气，无处不在又如此淡薄。 关于七宫，她其实是对于中二病的态度最为成熟的人。首先她很明确自己，对她来说勇太与中二是二选一的抉择，而她也艰难地做出了选择。尽管这抉择是艰难的，但是她不会后悔也无法后悔，空留遗憾。 分别的话从嘴里说出来的话，就要分别了；只要不说出分别就不会分别，那就是世界的真理。 七言秋雨似情长，宫影空明人不往。智绝情深不由伤，音泣相思泪以裳。 2.2 茴香与一色诚 其实这两人很纯粹，他们的关系也非常纯粹。五月七日茴香是一个天然呆，喜欢睡觉的学姐，对什么都不太关心，是软绵绵的性格；而一色诚是典型的日本高中生，换言之，是一个像我们一样普通的人。一色诚暗恋茴香学姐，茴香学姐对他印象不错，本应是很好的故事，只可惜茴香学姐太喜爱在精神与潜意识的海洋里探究自己的深度和智慧睡觉了，导致她并没有听到一色诚的告白，尽管局势不顺，但是我还是支持我诚哥！这里也祝各位恋爱中的读者早日成功！ 睡觉ing 结 年少不知愁滋味，爱上层楼，爱上层楼，为赋新词强说愁。 我亦年少，不识愁味，甚喜动漫，有感而发。 自认懂爱，实则不然，只欲书文，以泄所思。 不必认真。 感谢阅读。 这次成文效果感觉蛮差的，没写出我想要的效果，下次努力吧","categories":[{"name":"Artwork","slug":"Artwork","permalink":"https://light5qaq.github.io/categories/Artwork/"},{"name":"Entertainment","slug":"Artwork/Entertainment","permalink":"https://light5qaq.github.io/categories/Artwork/Entertainment/"}],"tags":[{"name":"Philosophy","slug":"Philosophy","permalink":"https://light5qaq.github.io/tags/Philosophy/"},{"name":"Literature","slug":"Literature","permalink":"https://light5qaq.github.io/tags/Literature/"},{"name":"Theory","slug":"Theory","permalink":"https://light5qaq.github.io/tags/Theory/"},{"name":"Anime","slug":"Anime","permalink":"https://light5qaq.github.io/tags/Anime/"}]},{"title":"Blog创建指南","slug":"Blog创建指南","date":"2025-08-22T08:51:13.000Z","updated":"2025-09-06T14:40:44.784Z","comments":true,"path":"2025/08/22/Blog创建指南/","permalink":"https://light5qaq.github.io/2025/08/22/Blog%E5%88%9B%E5%BB%BA%E6%8C%87%E5%8D%97/","excerpt":"关于如何以nexmoe主题建立blog的基础教程","text":"关于如何以nexmoe主题建立blog的基础教程 大家好，顾名思义，这是一篇教您如何建立blog的文章.俗语道: 前人栽树，后人乘凉 在我5个小时的试错后终于建立了我的blog并且总结了这篇文章的内容，希望可以帮助到您.本文是凭借记忆还原的，如果有错漏务必指正.Warning：下文默认您使用的是Windows系统本文主题将会使用nexmoe为例如果出现问题请先进行搜索，99%的问题都可以搜到答案有的问题是由于网络不佳，建议等会再试或使用VPN Chapter 1 安装Node.js在这里下载即可，点击Windows Installer.使用这个Installer进行安装即可. Chapter 2 安装Git在这里下载即可，点击Git-2.51.0-64-bit.exe.使用这个exe进行安装即可. Chapter 3 安装Hexo接下来您应当以管理员身份运行软件Windows PowerShell，如若您没有该软件，也可以点击Win+R，输入cmd代替，但是还是建议您使用该软件.然后输入npm install -g hexo-cli以下载Hexo如果网络不好可以使用VPN接着在C盘以外的地方建立一个文件夹，例如在D盘建立“blog”在cmd&#x2F;Shell内输入cd D:\\ ,再输入cd blog(请根据自己的情况适当更改以上两步)继续安装Hexo,输入hexo init myblog.您可将myblog换成想要的名字，最好使用英文. Chapter 4 安装nexmoe并配置输入npm install hexo-theme-nexmoe hexo-renderer-inferno接下来您可以在D:\\blog\\myblog(请根据自己的情况适当更改)中找到一个叫做_config.yml的文件使用文本文档进行编辑，找到“theme” 在后面加上nexmoe注意，冒号与“nexmoe”间有空格.不要忘记保存. Chapter 5 测试输入hexo server –debug如果没有错误反馈并且能够成功进入这里，那么您之前的步骤是正确的，如果不可以进入请搜索错误报告进行捉虫. Chapter 6 准备Github进入这里，点击右上角sign up，跟随指导注册账号并进入邮箱验证.接下来点击右上角加号，选择Create new repositories.将仓库名称命名为您的用户名.github.io，下方选择Public. Chapter 7 发布blog输入git config –global user.name “您的用户名”(注意引号不要落下)输入git config –global user.email “您的邮箱地址”接下来把_config.yml中最后的deploy改成这样的格式别忘了缩进和保存. deploy: type: ‘git’ repo: ‘这里放您的HTTPS’ branch: main HTTPS可以在您的GitHub仓库中找到.接下来先确保您的Shell&#x2F;cmd正在您的blog所在文件夹中.输入npm install hexo-deployer-git –save然后依次输入hexo clean,hexo g,hexo d. Chapter 8 测试如果没有错误反馈，GitHub仓库中出现文件，并且能够成功进入您的用户名.github.io这个网站，那么您之前的步骤是正确的，恭喜！到这里，您的blog已经成功上传了，未来的步骤请您自己探索吧！ Chapter 0 更多您可以在这里查看nexmoe的初步教程.您也可以在这里下载到使用人数更多的主题butterfly.如果您更倾向于观看视频教程，您可以在这里观看b站up@卷二兔很详细的视频教程在Chapter 7中HTTP的部分，您可以选择使用SSH，安全性更高但是更为麻烦.","categories":[{"name":"Tech","slug":"Tech","permalink":"https://light5qaq.github.io/categories/Tech/"}],"tags":[{"name":"Help","slug":"Help","permalink":"https://light5qaq.github.io/tags/Help/"}]},{"title":"Hello World","slug":"Hello World","date":"2025-08-22T06:05:39.000Z","updated":"2025-09-06T14:46:35.276Z","comments":true,"path":"2025/08/22/Hello World/","permalink":"https://light5qaq.github.io/2025/08/22/Hello%20World/","excerpt":"起源之作","text":"起源之作 欢迎来到我的博客，今天是博客建站的第一天，以后也请多多指教。","categories":[{"name":"Other","slug":"Other","permalink":"https://light5qaq.github.io/categories/Other/"}],"tags":[{"name":"Other","slug":"Other","permalink":"https://light5qaq.github.io/tags/Other/"}]}],"categories":[{"name":"Chat","slug":"Chat","permalink":"https://light5qaq.github.io/categories/Chat/"},{"name":"Artwork","slug":"Artwork","permalink":"https://light5qaq.github.io/categories/Artwork/"},{"name":"Entertainment","slug":"Entertainment","permalink":"https://light5qaq.github.io/categories/Entertainment/"},{"name":"Tech","slug":"Tech","permalink":"https://light5qaq.github.io/categories/Tech/"},{"name":"Entertainment","slug":"Artwork/Entertainment","permalink":"https://light5qaq.github.io/categories/Artwork/Entertainment/"},{"name":"Other","slug":"Other","permalink":"https://light5qaq.github.io/categories/Other/"}],"tags":[{"name":"Other","slug":"Other","permalink":"https://light5qaq.github.io/tags/Other/"},{"name":"Literature","slug":"Literature","permalink":"https://light5qaq.github.io/tags/Literature/"},{"name":"PH","slug":"PH","permalink":"https://light5qaq.github.io/tags/PH/"},{"name":"Philosophy","slug":"Philosophy","permalink":"https://light5qaq.github.io/tags/Philosophy/"},{"name":"Write-up","slug":"Write-up","permalink":"https://light5qaq.github.io/tags/Write-up/"},{"name":"Theory","slug":"Theory","permalink":"https://light5qaq.github.io/tags/Theory/"},{"name":"Code","slug":"Code","permalink":"https://light5qaq.github.io/tags/Code/"},{"name":"Anime","slug":"Anime","permalink":"https://light5qaq.github.io/tags/Anime/"},{"name":"Help","slug":"Help","permalink":"https://light5qaq.github.io/tags/Help/"}]}